## Production: terraform
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                 |
|--------|----------------------------------------------------------------------|
| add    | `module.gh_oidc_roles.aws_iam_role.this[&quot;gh_cac_report_apply_role&quot;]` |
|        | `module.gh_oidc_roles.aws_iam_role.this[&quot;gh_cac_report_plan_role&quot;]`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
21:53:34.429 STDOUT terraform:   + create
21:53:34.429 STDOUT terraform: Terraform will perform the following actions:
21:53:34.429 STDOUT terraform:   # module.gh_oidc_roles.aws_iam_role.this["gh_cac_report_apply_role"] will be created
21:53:34.430 STDOUT terraform:   + resource "aws_iam_role" "this" {
21:53:34.430 STDOUT terraform:       + arn                   = (known after apply)
21:53:34.430 STDOUT terraform:       + assume_role_policy    = jsonencode(
21:53:34.430 STDOUT terraform:             {
21:53:34.430 STDOUT terraform:               + Statement = [
21:53:34.430 STDOUT terraform:                   + {
21:53:34.430 STDOUT terraform:                       + Action    = "sts:AssumeRoleWithWebIdentity"
21:53:34.430 STDOUT terraform:                       + Condition = {
21:53:34.430 STDOUT terraform:                           + StringLike = {
21:53:34.430 STDOUT terraform:                               + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/aws-guardrails-cac-solution:ref:refs/heads/main"
21:53:34.430 STDOUT terraform:                             }
21:53:34.430 STDOUT terraform:                         }
21:53:34.430 STDOUT terraform:                       + Effect    = "Allow"
21:53:34.430 STDOUT terraform:                       + Principal = {
21:53:34.430 STDOUT terraform:                           + Federated = "arn:aws:iam::886481071419:oidc-provider/token.actions.githubusercontent.com"
21:53:34.430 STDOUT terraform:                         }
21:53:34.430 STDOUT terraform:                     },
21:53:34.430 STDOUT terraform:                 ]
21:53:34.430 STDOUT terraform:               + Version   = "2012-10-17"
21:53:34.430 STDOUT terraform:             }
21:53:34.430 STDOUT terraform:         )
21:53:34.430 STDOUT terraform:       + create_date           = (known after apply)
21:53:34.430 STDOUT terraform:       + force_detach_policies = false
21:53:34.430 STDOUT terraform:       + id                    = (known after apply)
21:53:34.430 STDOUT terraform:       + managed_policy_arns   = (known after apply)
21:53:34.430 STDOUT terraform:       + max_session_duration  = 3600
21:53:34.430 STDOUT terraform:       + name                  = "gh_cac_report_apply_role"
21:53:34.430 STDOUT terraform:       + name_prefix           = (known after apply)
21:53:34.430 STDOUT terraform:       + path                  = "/"
21:53:34.430 STDOUT terraform:       + tags                  = {
21:53:34.430 STDOUT terraform:           + "CostCentre" = "guardrails"
21:53:34.430 STDOUT terraform:           + "Terraform"  = "true"
21:53:34.430 STDOUT terraform:         }
21:53:34.431 STDOUT terraform:       + tags_all              = {
21:53:34.431 STDOUT terraform:           + "CostCenter"  = "guardrails"
21:53:34.431 STDOUT terraform:           + "CostCentre"  = "guardrails"
21:53:34.431 STDOUT terraform:           + "Environment" = "prod"
21:53:34.431 STDOUT terraform:           + "ManagedBy"   = "terraform"
21:53:34.431 STDOUT terraform:           + "Owner"       = "sre-team"
21:53:34.431 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
21:53:34.431 STDOUT terraform:           + "Terraform"   = "true"
21:53:34.431 STDOUT terraform:         }
21:53:34.431 STDOUT terraform:       + unique_id             = (known after apply)
21:53:34.431 STDOUT terraform:       + inline_policy (known after apply)
21:53:34.431 STDOUT terraform:     }
21:53:34.431 STDOUT terraform:   # module.gh_oidc_roles.aws_iam_role.this["gh_cac_report_plan_role"] will be created
21:53:34.431 STDOUT terraform:   + resource "aws_iam_role" "this" {
21:53:34.431 STDOUT terraform:       + arn                   = (known after apply)
21:53:34.431 STDOUT terraform:       + assume_role_policy    = jsonencode(
21:53:34.431 STDOUT terraform:             {
21:53:34.431 STDOUT terraform:               + Statement = [
21:53:34.431 STDOUT terraform:                   + {
21:53:34.431 STDOUT terraform:                       + Action    = "sts:AssumeRoleWithWebIdentity"
21:53:34.431 STDOUT terraform:                       + Condition = {
21:53:34.431 STDOUT terraform:                           + StringLike = {
21:53:34.431 STDOUT terraform:                               + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/aws-guardrails-cac-solution:*"
21:53:34.431 STDOUT terraform:                             }
21:53:34.431 STDOUT terraform:                         }
21:53:34.431 STDOUT terraform:                       + Effect    = "Allow"
21:53:34.431 STDOUT terraform:                       + Principal = {
21:53:34.431 STDOUT terraform:                           + Federated = "arn:aws:iam::886481071419:oidc-provider/token.actions.githubusercontent.com"
21:53:34.431 STDOUT terraform:                         }
21:53:34.431 STDOUT terraform:                     },
21:53:34.431 STDOUT terraform:                 ]
21:53:34.431 STDOUT terraform:               + Version   = "2012-10-17"
21:53:34.431 STDOUT terraform:             }
21:53:34.431 STDOUT terraform:         )
21:53:34.431 STDOUT terraform:       + create_date           = (known after apply)
21:53:34.432 STDOUT terraform:       + force_detach_policies = false
21:53:34.432 STDOUT terraform:       + id                    = (known after apply)
21:53:34.432 STDOUT terraform:       + managed_policy_arns   = (known after apply)
21:53:34.432 STDOUT terraform:       + max_session_duration  = 3600
21:53:34.432 STDOUT terraform:       + name                  = "gh_cac_report_plan_role"
21:53:34.432 STDOUT terraform:       + name_prefix           = (known after apply)
21:53:34.432 STDOUT terraform:       + path                  = "/"
21:53:34.432 STDOUT terraform:       + tags                  = {
21:53:34.432 STDOUT terraform:           + "CostCentre" = "guardrails"
21:53:34.432 STDOUT terraform:           + "Terraform"  = "true"
21:53:34.432 STDOUT terraform:         }
21:53:34.432 STDOUT terraform:       + tags_all              = {
21:53:34.432 STDOUT terraform:           + "CostCenter"  = "guardrails"
21:53:34.432 STDOUT terraform:           + "CostCentre"  = "guardrails"
21:53:34.432 STDOUT terraform:           + "Environment" = "prod"
21:53:34.432 STDOUT terraform:           + "ManagedBy"   = "terraform"
21:53:34.432 STDOUT terraform:           + "Owner"       = "sre-team"
21:53:34.432 STDOUT terraform:           + "Project"     = "aws-guardrails-cac-solution"
21:53:34.432 STDOUT terraform:           + "Terraform"   = "true"
21:53:34.432 STDOUT terraform:         }
21:53:34.432 STDOUT terraform:       + unique_id             = (known after apply)
21:53:34.432 STDOUT terraform:       + inline_policy (known after apply)
21:53:34.432 STDOUT terraform:     }
21:53:34.432 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
21:53:34.432 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
21:53:34.432 STDOUT terraform: Saved the plan to: plan.tfplan
21:53:34.432 STDOUT terraform: To perform exactly these actions, run the following command to apply:
21:53:34.432 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.daily_compliance_check"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.s3_csv_to_slack_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.s3_csv_to_slack_duration"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.s3_csv_to_slack_errors"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.s3_csv_to_slack_s3_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.s3_csv_to_slack_lambda_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.s3_csv_to_slack"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.guardrails_alerts"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]

28 tests, 19 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
